const hgAlgorithm = require('./Hungarian');

const workerToJob = [
  [82, 83, 69, 92],
  [77, 37, 49, 92],
  [11, 69, 5, 86],
  [8, 9, 98, 23],
];

console.log(`Оптимальним є призначення робочого 1 на роботу 3, працівника 2 на роботу 2, працівника 3 на роботу 1 та працівника 4 на роботу 4.\n` +
  `Загальний мінімальний час тоді становить 69 + 37 + 11 + 23:`);
console.log(hgAlgorithm(workerToJob, "min"));

console.log(`Максимальний є призначення робочого 1 на роботу 2, працівника 1 на роботу 2, працівника 3 на роботу 4 та працівника 4 на роботу 3.\n` +
  `Загальний максимальний час тоді становить 83 + 77 + 86 + 98:`);
console.log(hgAlgorithm(workerToJob, "max"));

// Tests data
// const test1 = [
//   [10, 19, 8, 15],
//   [10, 18, 7, 17],
//   [13, 16, 9, 14],
//   [14, 17, 10, 19]
// ];
// const test2 = [
//   [10, 19, 8, 15],
//   [10, 18, 7, 17],
//   [13, 16, 9, 14],
//   [12, 19, 8, 18],
//   [14, 17, 10, 19]
// ];
// const test3 = [
//   [10, 19, 8, 15, 14],
//   [10, 18, 7, 17, 17],
//   [13, 16, 9, 14, 10],
//   [12, 19, 8, 18, 19]
// ];
